{
    "kind": "Scheduled",
    "properties": {
        "description": "'Identifies new UserAgents observed in the last 24 hours versus the previous 14 days. These new UserAgents could be benign. \nHowever, in normally stable environments, these new UserAgents could provide a starting point for investigating malicious activity.'\n",
        "severity": "Low",
        "requiredDataConnectors": [
            {
                "connectorId": "AWS",
                "dataTypes": [
                    "AWSCloudTrail"
                ]
            },
            {
                "connectorId": "Office365",
                "dataTypes": [
                    "OfficeActivity"
                ]
            },
            {
                "connectorId": "AzureMonitor(IIS)",
                "dataTypes": [
                    "W3CIISLog"
                ]
            }
        ],
        "queryFrequency": "P1D",
        "queryPeriod": "P14D",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "tactics": [
            "InitialAccess",
            "CommandAndControl",
            "Execution"
        ],
        "relevantTechniques": [
            "T1189",
            "T1071",
            "T1203"
        ],
        "query": "\nlet starttime = 14d;\nlet endtime = 1d;\nlet UserAgentAll =\n(union isfuzzy=true\n(OfficeActivity\n| where TimeGenerated >= ago(starttime)\n| where isnotempty(ExtendedProperties)\n| where ExtendedProperties has \"useragent\"\n| extend UserAgent = extractjson(\"$[0].Value\", ExtendedProperties, typeof(string))\n| where isnotempty(UserAgent)\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by UserAgent, SourceIP = ClientIP, Account = UserId, Type, RecordType, Operation\n),\n(\nW3CIISLog\n| where TimeGenerated >= ago(starttime)\n| where isnotempty(csUserAgent)\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by UserAgent = csUserAgent, SourceIP = cIP, Account = csUserName, Type, sSiteName, csMethod, csUriStem\n),\n(\nAWSCloudTrail\n| where TimeGenerated >= ago(starttime)\n| where isnotempty(UserAgent)\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by UserAgent, SourceIP = SourceIpAddress, Account = UserIdentityUserName, Type, EventSource, EventName\n));\nUserAgentAll\n| where StartTimeUtc < ago(endtime)\n| summarize by tostring(UserAgent), SourceIP, Account, Type, RecordType, Operation, EventSource, EventName, sSiteName, csMethod, csUriStem\n| join kind=rightanti\n(\nUserAgentAll\n| where StartTimeUtc >= ago(endtime) \n| summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), count() by tostring(UserAgent), SourceIP, Account, Type, RecordType, Operation, EventSource, EventName, sSiteName, csMethod, csUriStem\n) on UserAgent, SourceIP, Account, Type, RecordType, Operation, EventSource, EventName, sSiteName, csMethod, csUriStem\n| extend timestamp = StartTimeUtc, IPCustomEntity = SourceIP, AccountCustomEntity = Account\n",
        "displayName": "New UserAgent observed in last 24 hours",
        "enabled": true,
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false
    }
}