{
    "kind": "Scheduled",
    "properties": {
        "description": "'Identifies clients with a high reverse DNS counts which could be carrying out scanning activity.\nAlert is generated if the IP performing such reverse DNS lookups was not seen doing so\nin the preceding 7-day period.'\n",
        "severity": "Medium",
        "requiredDataConnectors": [
            {
                "connectorId": "DNS",
                "dataTypes": [
                    "DnsEvents"
                ]
            }
        ],
        "queryFrequency": "P1D",
        "queryPeriod": "P8D",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "tactics": [
            "Discovery"
        ],
        "relevantTechniques": [
            "T1046"
        ],
        "query": "\nlet starttime = 8d;\nlet endtime = 1d;\nlet threshold = 10;\nDnsEvents \n| where TimeGenerated > ago(endtime)\n| where Name contains \"in-addr.arpa\" \n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), dcount(Name) by ClientIP\n| where dcount_Name > threshold\n| project StartTimeUtc, EndTimeUtc, ClientIP , dcount_Name \n| join kind=leftanti (DnsEvents \n    | where TimeGenerated between(ago(starttime)..ago(endtime))\n    | where Name contains \"in-addr.arpa\" \n    | summarize dcount(Name) by ClientIP, bin(TimeGenerated, 1d)\n    | where dcount_Name > threshold\n    | project ClientIP , dcount_Name \n) on ClientIP\n| extend timestamp = StartTimeUtc, IPCustomEntity = ClientIP\n",
        "displayName": "Rare high reverse DNS count",
        "enabled": true,
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false
    }
}